In [1]:
print ('hello world!')

hello world!

In [4]:
#list
fruits = [] #empty list
fruits = ['apple', 'banana']#list with 2 elements
another_list =[ 'this is string',10] #list with different types of element.

print (fruits)
print (another_list)
combined= (fruits, another_list)
print (combined)

['apple', 'banana']
['this is string', 10]
(['apple', 'banana'], ['this is string', 10])

In [5]:
#add elements
fruits.append('orange')#append is the syntax to add
print(fruits)

fruits= fruits+['manggo']
print(fruits)

['apple', 'banana', 'orange']
['apple', 'banana', 'orange', 'manggo']

In [6]:
#Tuple
#tuple is similar to list but immutable once created
#1. list bisa ditambahkan isinya, kalau tuple gak bisa
#2. list bisa gabungan tipe datanya: string, numerik dan lain-lain
#3. list pakai kurung siku, tuple kurung biasa, set
coordinate= (0,5)
colors= ('red','green','blue')
print(coordinate)
print(colors)

(0, 5)
('red', 'green', 'blue')

In [7]:
#data integration
import numpy as np
import pandas as pd

In [9]:
#mergin
left= pd.DataFrame ({'key':['K0','K1','K2','K3'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})

right= pd.DataFrame ({'key':['K0','K1','K2','K3'],
                     'C':['C0','C1','C2','C3'],
                     'D':['D0','D1','D2','D3']})
result1= pd.merge(left,right, on='key')

In [10]:
result1

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [11]:
#multiple key
left= pd.DataFrame ({'key1':['K0','K1','K2','K3'],
                     'key2':['K0','K1','K2','K3'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})

right= pd.DataFrame ({'key1':['K0','K1','K2','K3'],
                      'key2':['K0','K1','K2','K3'],
                     'C':['C0','C1','C2','C3'],
                     'D':['D0','D1','D2','D3']})
result2= pd.merge(left,right, on=['key1','key2'])
result2

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K1  A1  B1  C1  D1
2   K2   K2  A2  B2  C2  D2
3   K3   K3  A3  B3  C3  D3

In [12]:
#export data
data1=pd.read_csv("data1.csv",sep=";")
data2=pd.read_csv("data2.csv",sep=";")

In [13]:
data1

  nama  berat  usia
0    a     55    19
1    b     50    20
2    c     55    18
3    d     48    22
4    e     60    21
5    f     65    23
6    g     44    25
7    h     88    24
8    i     60    26
9    j     70    27

In [14]:
data=pd.merge(data1,data2, on='nama')
data.head()
data

  nama  berat  usia  tinggi
0    a     55    19     155
1    b     50    20     156
2    c     55    18      16
3    d     48    22     162
4    e     60    21     167
5    f     65    23     158
6    g     44    25     150
7    h     88    24     160
8    i     60    26     172
9    j     70    27     165

In [ ]:
#menggabungkan baris
#hasil=pd.concat(data1,data2)